Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: If you have the setting as "Windows" in the main GameMaker: Studio window, then only a Windows compatible file will be made.
zh_cn: • 如果在 GameMaker: Studio 窗口 target 设置了 "Windows" ，那么就 只能 生成兼容 Windows 的文件。

source: If you have this window open, you can also double-click on an event in any instance from the resource tree and it's code will be shown in a new tab.
zh_cn: 在该窗口打开的状态下，你也可以双击资源树中的任一实例中的事件来在新的子窗口中显示其中的代码。

source: If you have used previous GameMaker products and are thinking about upgrading to Studio then you can use this version to see the differences between it and previous versions, or if you have never used GameMaker before (or are new to programming) then this version is an excellent place to start.
zh_cn: 如果你已经使用过以前的 GameMaker 产品，你可以升级到这个版本看看有什么差异，而没使用过 GameMaker 也没关系(或者从未接触过编程)，这个版本是一个好的开始。

source: If you have used the display_set_gui_maximise() function then the (0,0) position for the GUI layer will default to the top left corner of the game window, or display (when in fullscreen or on devices), with the scaling factor set by that function, and the width and height set by this one.
zh_cn: 如果你已经使用 display_set_gui_maximise() 函数，然后GUI层的 (0,0)位置将默认为游戏窗口或显示器的左上角（全屏或者在移动设备上），用那个函数设置缩放因数，这个函数设置宽度和高度。

source: If you have views visible and then disable this option, the whole room will be drawn to the screen scaled to the window size.
zh_cn: 视野可见时关闭这个选项，整个房间绘制到屏幕，画面缩放至窗口大小

source: If you master the DnD interface and how it works to control basic things in objects, you can then move on to the easy to learn programming language GML which gives you much more control over every aspect of GameMaker: Studio.
zh_cn: 如果您掌握了 DnD 界面并且了解它是如何控制物体的基础事件，就可以学习简单的编程语言GML，使得您可以用 GameMaker: Studio控制您的游戏的各个方面。

source: If you only have one view active (and so only one view port) setting the x or y value of the port can have some interesting effects but is not normally practical (see the image below) and so it is better to maintain the x and y position as (0,0).
zh_cn: 如果你仅有一个活动视野（因此只有一个视口），设置视口的x或y值，可以产生一些有趣的效果，但通常并不实用（看下面的图），所以最好保持x和y坐标为(0,0)。

source: If you plan on using the audio emitter functions to create 3D sound effects, you should indicate this here, otherwise choose mono or stereo depending on the use that the sounds are going to be put to.
zh_cn: 如果你打算使用音频发射器功能来创建 3D 音效，你应该指明位置，否则在声音播放时将使用单声道或立体声。

source: If you select "Load Background", you will get the standard file selector where you can choose supported image file (PNG, GIF, BMP, JPG.) and also tell GM to make that image opaque (remove transparency), or make it transparent (this takes the colour from the bottom left hand corner pixel as the base colour to make transparent) or to smooth the edges of the background (only when it is transparent).
zh_cn: 如果你选择 "Load Background (加载背景)"，会打开标准的文件选择器以选择支持的图像 (PNG、GIF、BMP、JPG)。在这里你还可以选择不透明 (去除任何透明部分)、去除背景色 (如果有使其透明)或者平滑边缘(如果它是透明的)。

source: If you select Play then GameMaker: Studio will close and the Steam Player will open, however if you choose Make then you will be presented with the standard GameMaker: Studio start-up screen.
zh_cn: 如果你选择 Play GameMaker: Studio 会关闭， Steam Player 将会打开，但是如果选择了 Make 你将会看到标准的 GameMaker: Studio 启动界面。

source: If you select a point on your path (either by clicking on it in the editor or by clicking the point list on the left of the editor) and then click on Insert, a new point will be "inserted" into the path at the same position.
zh_cn: 如果你选中路径上的一个路径点（不管你是直接点击这个点还是在路径点列表中选中的这个点），然后点击 Insert 按钮，那么一个新的点将被插入到你选中的那个点的同一位置上。

source: If you selected these you can press the button labelled Edit Sound to open the chosen editor and change the current sound.
zh_cn: 如果设置妥当，你可以按下 Edit Sound 按钮打开外部编辑器。

source: If you switch it back on again, then the Global Game Settings will take effect again the next step.
zh_cn: 如果你切换回来，全局游戏设定下一步会再次生效。

source: If you use the script action you can specify the script you want to execute, together with the up to five arguments, but if you are using the code editor to call a script, you can pass up to sixteen arguments.
zh_cn: 如果你是用的脚本动作，你可以指定你要调用的脚本名称，以及最多5个参数。但是如果你在代码中调用脚本，那么你最多可以使用16个参数。

source: If you use this function to change the size of the game window, the contents of the window will be scaled to fit with a 1:1 ratio to the background canvas which will keep the image crisp and clear (although scaled if the window is other than the room or view size).
zh_cn: 如果你使用这个函数改变游戏窗口口的大小，窗口内容将与背景画布以1：1的比例进行调整，以保持图像的清晰和明确（尽管缩放窗口不同于房间或视野）。

source: If you wish it to be only exported when you run the game in a browser, then you would only tick the "HTML5" box, and if you want it to be exported only to Android and iOS targets you would tick those, and so on.
zh_cn: 如果你希望仅仅在 你用浏览器运行这个游戏时这个文件才会被解包出来，那么你应当只选择“HTML5”这一项；如果你只希望它在安卓或IOS平台上使用那么你应当只选择这两项；其它同理。

source: If you wish to go back to the default behaviour (ie: no mimimum), then use a value of -1.
zh_cn: 如果想要回到默认的情况（比如没有最小值限制），只要使用值-1就可以。

source: If your copy of GameMaker: Studio has been bought through Steam, you will see that there is an additional target module for compiling to apart from the standard Windows and Mac OS X targets: When running your game through GameMaker: Studio normally (or in debug mode), this target module functions exactly the same as the standard Windows compiler and will permit you to play and test your game in the Windows workspace.
zh_cn: 如果你从 Steam 购买了 GameMaker: Studio 你将看到额外增加了 Steam Workshop 模块: 当你在 GameMaker: Studio 里运行你的游戏 (或 debug mode (调试模式))，这个模块会像标准的 windows 模块一样编译它，并且在 Windows 环境运行和测试。

source: If your copy of GameMaker: Studio has been bought through Steam, you will see that when you start GameMaker: Studio you are presented with a splash screen containing two buttons - Play and Make.
zh_cn: 如果你从 Steam 上购买了 GameMaker: Studio ，当你运行 GameMaker: Studio 的时候你将会看见启动屏幕包含两个按钮 Play (玩) 和 Make (制作)。

source: If your display is 1024x768 and you set the scaling factor to scale by 0.5, then your GUI layer will be half the size of the display, effectively doubling the pixel size.
zh_cn: 如果显示器是1024x768 ，设置缩放因数为 0.5，GUI层将是显示器大小的一半，有效的增加了一倍的像素（翻译修改建议 @断水）。

source: If your version of GameMaker: Studio has not been bought through Steam, you will need to run the program GMStudio-Installer.exe and follow the on-screen instructions to install.
zh_cn: 如果您的 GameMaker: Studio 版本 不是 从 Steam 购买的，您需要运行 GMStudio-Installer.exe 程序并且根据屏幕上的提示安装。

source: Important
zh_cn: 重要

source: Importing Resources
zh_cn: 导入资源

source: In App Purchases
zh_cn: 应用内购

source: In GML a function has the form of a function name, followed by the input arguments between brackets and separated by commas (if the function has no input arguments then just brackets are used).
zh_cn: GML函数结构是，一个函数名，后面是括号之内的输入的参数，参数用逗号分隔（如果没有参数，仅仅用括号就可以了）。

source: In a game made with GameMaker: Studio, the characters, monsters, balls, walls, etc... are all instances copied from a basic object template that is found in the resource tree and then placed in a room.
zh_cn: GameMaker: Studio 制作的游戏中，角色、怪物、墙等都是一个个放置在房间中的物体的实例。

source: In a number of situations you want to let your instances complete an action depending on a particular value.
zh_cn: 很多情况下，你想要实例根据一个特定值完成一个动作。

source: In a time line a moment is the same as a step, so ten moments on your time line are the same as ten steps in your game, and you can insert any number of actions and/or code into one moment and the object that has the time line assigned to it will carry out these actions at the required time.
zh_cn: 在时间轴中，一个时刻等同于一步，因此时间轴里的10个时刻等同于游戏中的10步，并且你在任何一个时刻都可以执行任意多的动作，然后被绑定上这个时间轴的物体就会在特定的时间点里执行这些动作。

source: In a time line you specify which actions must happen at certain moments in game time, and you can use all the actions that are also available for an object in its different events.
zh_cn: 在一个时间轴中你可以指定在某个游戏中的时间点执行某些特定的动作。你可以像在物体的事件中一样去调用各种动作。

source: In general the default value is fine for most games.
zh_cn: 通常来说默认值适用于大多数游戏。

source: In general you would want to have it as an option in a menu of your game, or call it only once at the start of your game and write your code around whether you have it enabled or disabled.
zh_cn: 基本上，你可能只是想把它作为游戏菜单中的一个选项，或者在游戏开始时调用一次，并围绕着启用或禁用来写这些代码。

source: In general, Wave files (*.wav) are used for the short sound effects as even though they are generally larger files they will play instantaneously due to the fact that they do not need any type of decoding for playing.
zh_cn: 通常 Wave 文件 (*.wav) 用于短的音效。尽管它们通常较大但播放时不需要任何类型的解码，会瞬间播放。

source: In general, this format should only be used when you have a single instance of the object in the room, or (as you will see in the next part) when you have a specific instance ID.
zh_cn: 基本上，“a.b”这种形式只用于房间内只有单个物体的实例，或者（后面将会看到）当你知道一个特定实例的ID。

source: In general, this is used to only render specific details to a single view when multiple views are visible in the room at the same time.
zh_cn: 一般情况下，当多个视野同时可见时，这个变量只用来渲染某个视野的特定细节。

source: In most cases you can simply use the os_is_paused function to test this, but in some very specific cases (for example games on Chrome Apps) that function will not trigger, in which case you should use this function instead.
zh_cn: 大多数情况，简单的使用 os_is_paused 测试焦点是否存在，但是一些特殊的情况（比如Chrome Apps 游戏）那个函数不会触发，这时使用本节所说的这个函数替之。

source: In most games you will want certain things to happen at certain moments in time.
zh_cn: 在大部分游戏中，你可能希望一些事情在特定的时间里发生。

source: In practice it would look like this:
zh_cn: 实际看起来是这样的：

source: In such a case you can make the instance stop or reverse direction or any number of other actions, like play a sound effect or add points to a score.
zh_cn: 在这种情况下你可以使实例停止、逆转方向或其他任何行动，例如播放音效或者加分。

source: In the event itself you would handle the callback something like this: Async Event in the following way:
zh_cn: 在事件本身的回调中你需要像这样来处理: 通过异步事件的方式:

source: In the file menu you can find the commands you'd expect for loading and saving files, but there are also a few special ones:
zh_cn: 在文件菜单里可以找到你所期望的加载和保存文件命令，但也有一些特殊的命令:

source: In the normal draw events, GameMaker: Studio doesn't actually draw directly to the screen, but rather draws to a surface called the application surface.
zh_cn: 在普通绘制事件中，GameMaker: Studio实际上并未直接绘制到屏幕上，而是绘制到一个称作应用表面的表面层上。

source: In the sections dedicated to variables you found out how to create and create and use variables within a single instance, or on a global scope, but what happens if you want to one instance to access a variable in another, different one?
zh_cn: 在专属于 变量的这一节，你会发现怎样创建，以及在单个实例中创建和使用变量，或者全局变量，但是如果你想在一个实例中访问另外一个不同的实例的变量会怎么样？

source: In these cases, Local and Remote push notifications can allow these games to notify their users when events occur.
zh_cn: 在这些情况下, 本地和远程推送通知可以让游戏在事件发生时通知用户。

source: In these rooms you place objects, which you can define within the program.
zh_cn: 在这些房间里您放置可以用程序定义的 物体。

source: In this case the expression will be evaluated, and if the (rounded) value is < = 0 (false) the statement after else is executed, otherwise (true) the other statement is executed.
zh_cn: 在这个情况下，对这个表达式（expression）进行求值，并且如果（近似）值是<=0（false），语句后面的else被执行，否则（true）另一个语句被执行。

source: In this case, any text or image displayed on display 2 will appear much larger, even though the actual resolution is the same.
zh_cn: 这种情况下，显示器2上的任何文字或图像将会更大，即使实际上分辨率是一样的。

source: In this event, you can check the returned async_load ds_map for the following values:
zh_cn: 此时，你可以检查返回的 async_load ds_map 为下列值：

source: In this example we will send a local push notification using the following code:
zh_cn: 在这个示例中,我们将使用下面的代码来发送一个本地推送通知:

source: In this extended example, we will create a surface and assign it to view 0, then draw that to the screen in the Draw GUI event.
zh_cn: 在这个扩展例子里，我们将创建一个表面并且指定给 view 0，然后在 Draw GUI 事件中绘制到屏幕上。

source: In this section of the manual you can learn about sprites and how to create them with the GameMaker: Studio sprite editor.
zh_cn: 手册的这部分你可以了解有关 sprites 和如何在 GameMaker: Studio sprite 编辑器里创建它们。

source: In this section we describe the language GML and we give an overview of all the functions and variables available to control all aspects of your game.
zh_cn: 这一部分将讨论GML语言，概述游戏所有方面可能用到的所有函数和变量。

source: In this section we will describe the basic structure of GML functions and how they are used to create your own programs and generally control your games.
zh_cn: 本章节讲解GML的语法知识，告诉你如何编写自己的脚本，并控制游戏逻辑。

source: In this way you can create some nice dynamic-looking movement without any code whatsoever!
zh_cn: 用这种方法你可以创建不少看上去很棒的动态运动，并且不需要写一行代码！

source: In this way you can quickly change between the different modules that you have installed on GameMaker: Studio and make sure that your project works as it should on all of them.
zh_cn: 这种方式可以很快地使用 GameMaker: Studio 内不同的模块生成不同的文件。

source: In those cases you can switch off drawing to the application surface and all Draw event drawing will the be done directly to the screen buffer.
zh_cn: 那种情况你可以关闭绘制到应用表面层这个过程，绘制事件中的绘制将直接在屏幕缓存区中完成。

source: Including Files
zh_cn: 包含文件

source: Increment/Decrement
zh_cn: 递增/递减

source: Index
zh_cn: 索引

source: Info Bar
zh_cn: 信息栏

source: Information
zh_cn: 信息

source: Information on the GML language can be found in the following pages:
zh_cn: GML的全部内容都列于下文：

source: Initializing an array just means that we give each position of the array an initial value in preparation for it to be used elsewhere in the object or code.
zh_cn: 初始化数组的意思就是给数组中每一个位置的数据赋予一个初始值，以便我们之后的物体或者代码块中使用。

source: Installation
zh_cn: 安装

source: Installation and System Requirements
zh_cn: 安装及系统需求

source: Installing GameMaker: Studio for personal use.
zh_cn: 安装个人使用的 GameMaker: Studio。

source: Instance
zh_cn: Instance（实例）

source: Instead, you must reset the target for each of the surfaces that you set, much like you must use opening and closing brackets {} for code blocks.
zh_cn: 换之，你必须为每一个设置的表面重置目标，就像你必须在代码中使用打开和关闭的大括号{} 。

source: Invisible objects will still react to events and if they have a sprite or a mask assigned to them, they will also react should other instances collide with them... they just can't be seen and do not perform their draw event.
zh_cn: 不可见的物体仍然会对事件作出反应，如果他们有精灵或者遮罩也会发生碰撞事件，他们只不过是不可见并且不会执行绘制事件。

source: It also covers how to define objects with events and actions, and how to add them into the rooms that you design.
zh_cn: 它还包括如何定义含有事件和动作的物体，以及怎么添加到你设计的房间。

source: It also doesn't matter if you are testing on an iPhone or an iPad as all iOS project builds created by GameMaker: Studio are, as standard, universal apps.
zh_cn: 对于用 GameMaker: Studio 建立的所有iOS项目，不论是测试 iPhone 还是 iPad 都没有关系，因为它们是标准的、通用的应用。

source: It always exists, although the index value to access it may change.
zh_cn: 它一直会存在，尽管访问它的索引值可能会改变。

source: It can also be useful for clearing surfaces when they are newly created.
zh_cn: 当新建表面时，它也可用于填充 表面 。

source: It can be a very useful feature for debugging and getting an overview of any object.
zh_cn: 在调试或获得任何物体的概述时这将非常有用。

source: It can be used for HTML5 too, but will only return a value relative to the 0,0 of the canvas itself, and will not return any value while the mouse is outside of the canvas.
zh_cn: 当然HTML5也可以一用，但只是返回相对于画布(0,0)的一个值，鼠标在画布外面时不会返回任何值。

source: It has this form:
zh_cn: 结构如下：

source: It is a good habit to always put curly brackets around the statements in the if", and take a new line in the block for each statement, so the end code will have this form:
zh_cn: 经常在if后面的语句放上花括号是一个好习惯，并且为每一个语句另起一行，所以最终代码将会有这种格式：

source: It is also recommended that your device have a dedicated GPU with OpenGL version 1.1 or above.
zh_cn: 并且建议您的设备最好有一个专门的 GPU OpenGL 1.1 或以上版本。

source: It is also worth noting that the length of each 2D array can be different, so you can have an array with a height of 2, but entry 0 could be 2 in length, entry 1 could be 4 in length and entry 2 could be 3 in length:
zh_cn: 同样值得注意的是，每一个二维数组的长度可以是不同的，所以你可以有一个数组的高度是2，但入口0的长度是2、入口1的长度是4，并且入口2的长度是3：

source: It is also worth noting that you can use the accessor @ to reference an array from a script and change its values directly, which saves the CPU overhead of having it copied into the script.
zh_cn: 值得注意的是，你可以使用访问器 @ 在脚本中引用并直接更改数组的值，这样可以节省将数组复制到脚本中的CPU开销。

source: It is always recommended that you make sure you have the most recent drivers installed for your system.
zh_cn: 确保您的电脑安装了最新的驱动。

source: It is highly recommended that all surfaces be created with a size that is a power of 2, ie: 16, 128, 512 or 1024 pixels in size, for example.
zh_cn: 强烈建议所有创建的表面图层大小设置为2的N次方，比如16、128、512、1024像素。

source: It is important to note that while the game is running it doesn't update the debug windows with variable values and other details by default, therefore you must first use the "Pause" button in the Debug Module to pause the game before Locals, Globals and other data will be available, or enable real-time updating from the icons at the top.
zh_cn: 一件重要的事需要注意，当游戏运行时变量值和其他细节默认是不会更新调试窗口的，因此你必须在局部、全局和其他数据被有效化之前在调试模块里首先使用“暂停”按钮来暂停游戏，或者点击顶端的图标启用实时更新。

source: It is recommended that you use this function carefully as wit will impact on how everything is drawn to the screen.
zh_cn: 建议小心的使用这个函数，它会影响一切事物绘制到屏幕的过程。

source: It is sometimes necessary for you to know how many arguments that a script has been passed from the code that calls it, and so GameMaker: Studio also provides the following read-only variable for this:
zh_cn: 有时候，知道向脚本中传递了多少个参数是非常有必要的，GameMaker: Studio也提供了下面的只读变量来获取这个值：

source: It is worth noting that placing this before or after the value to be added to or subtracted from will have slightly different results.
zh_cn: 值得注意的是在值之前或之后使用这个运算符结果稍微有些不同。

source: It is worth noting that when using the HTML5 module, you can use this function to make the canvas background transparent, which will then permit any images being used in the host HTML to be seen with the game running over them.
zh_cn: 当使用HTML5模式的时候需要注意，你可以使用本函数使一个canvas背景透明，它允许你在游戏运行的时候从网络上载入一些图像。

source: It requires a screen resolution of at least 1024x768 and 65536 (16-bit) colours (but preferably 32-bit true colour).
zh_cn: 需要至少 1024x768像素 和 65536 (16位) 色 (最好是32位真彩色)的屏幕。

source: It returns -1 if there are no further notifications queued, or a real value otherwise representing the ID for the notification.
zh_cn: 返回 -1 代表之后已没有通知，返回其他的真值为通知的ID。

source: It returns -1 if there are no notifications queued, or a real value otherwise representing the ID for the notification.
zh_cn: 返回 -1 代表通知队列为空即没有通知，返回其他的真值为通知的ID。

source: It should also be noted that depending on the preferences you have selected for GameMaker: Studio these resources may also be removed from the hard-drive.
zh_cn: 需要注意的是不仅是在 GameMaker: Studio 里，硬盘里相应的文件也会被删除。

source: It should also be noted that if you do not have any rooms in your game then GameMaker: Studio will not run your game.
zh_cn: 需要注意的是，如果没有任何房间，GameMaker: Studio 不会运行游戏。

source: It should also be noted that if you have assigned a sprite to the object and then assign a mask, GameMaker: Studio will always base collisions off of the assigned mask and NOT the sprite.
zh_cn: 如果你同时为物体制定了精灵和遮罩，GameMaker: Studio 在检测碰撞事件的时候总是检测遮罩而不是精灵。

source: It should be noted here that GameMaker: Studio focuses on two-dimensional games (which isn't to say that it's not capable of 3D, as it is!) and many great games use 2D sprite technology, even though they look very 3D when playing.
zh_cn: 这里要注意的是 GameMaker: Studio 着重于2D游戏 (并不是说不能制作3D游戏！) 并且很多很棒的游戏都是使用2D精灵技术，即使他们在运行起来像是3D的。

source: It should be noted that the execution of the script ends at the return statement, meaning that any code which comes after the return has been called will not be run.
zh_cn: 应该注意的是“return”语句将结束脚本运行，意味着任何它之后的语句代码将不会运行。

source: It should be noted that this function only works properly when used on the Windows target.
zh_cn: 应该注意的是，这个函数只在windows平台有效。

source: It should be noted, that the older the file type, the less likely they are to run without a lot of rework due to the changes wrought in GameMaker through the years.
zh_cn: 值得注意的是，那些老的文件类型，很可能是很多年没变化的游戏返工。

source: It takes a value as left operand and a variable (address) as the right operand, and returns the address of this particular variable in the indicated object or instance.
zh_cn: 它给定一个值作为左边的操作数，以及一个变量（地址）作为右边的操作数，接着返回指定物体或实例中特定变量的地址。

source: It will also do the same when using the with function, where it will cause the code to skip to the next instance and run again.
zh_cn: 在 with函数中使用也是一样，它将跳到下一个实例继续运行。

source: It will only disappear when you explicitly destroy it, either with a destroy action or in code.
zh_cn: 而是仍然呆在相同的位置，除非你明确地让它摧毁。

source: It will return true for portrait and false for landscape.
zh_cn: 纵向返回 真横向返回 假。

source: It will return true if you have active the alternative method v-sync method, or false if you are using the regular v-sync option.
zh_cn: 如果你激活了垂直同步的替代方法（断水注：并非返回垂直同步是否激活，而是指替代方法），它将返回true ，或者如果你使用常规的垂直同步方式，它则返回false 。

source: It works in the same way as Windows Explorer, and you are most likely familiar with how it should work.
zh_cn: 它的工作方式和Windows资源管理器类似，所以你可以在制作游戏的时候找到熟悉的感觉。

source: It's best to give each background a descriptive name so that you can identify at a glance whether a particular resource is a background or an object or anything else, and many people do this by prefixing or suffixing the resource with the letters "bck".
zh_cn: 最好给背景一个描述性的名称以便你可以一目了然地区分它和其他类型的资源，许多人通过添加 "bck" 前缀或后缀来区分。

source: It's best to give each sprite a descriptive name so that you can identify at a glance whether a particular resource is a sprite or an object or anything else, and many people do this by prefixing or suffixing the resource with the letters "spr".
zh_cn: 你应该给每个精灵一个描述性的名称以便可以一眼识别特定的资源是一个精灵或是其他的什么，很多人通常会加一个 "spr" 前缀或后缀。

source: It's generally recommended that you use the latest OS X and the latest Xcode (you can find the version your Mac has by clicking on the "Apple" logo in the top left and selecting the "About this Mac" option from the drop down menu).
zh_cn: 通常建议您使用最新的OS X和新的Xcode (您可以点击顶部左侧的 "苹果" logo 并选择 "关于MAC" 找到您的MAC版本)。

source: It's in these rooms that the game takes place, and they can be considered essentially as "levels" to your game.
zh_cn: 这些房间是游戏运行的地方，你也可以理解为游戏中的 “等级”。

source: It's very similar to the object properties window as you can specify a name for your time line (like all resources, this should be specific and unique), and with an action list and actions on the right, and there is even a Show Information button that can be used to get an overview of all actions within the time line.
zh_cn: 这个窗口和物体的属性窗口很类似，你可以在这里给时间轴起一个名字（像其它资源一样，必须是个独一无二的名字），同时在右侧有一个动作列表以及一系列可用动作。甚至还有一个 Show Information 按钮来显示时间轴的动作信息。

source: It's worth noting that an array always starts at 0 and can never be negative!
zh_cn: 需要注意的是数组编号 开始于0 并且 永远不能为负数。

source: Just like any other variable, it can be anything you want from simply "a" to "mymumscow".
zh_cn: 就像变量的名字，你可以给它取任意的名字，比如“a”或者“mymumscow”。

source: Just like normal variables, you can pass arrays through to scripts to be used and then returned to the instance that called the script.
zh_cn: 就像普通的变量，你也可以传递数组到脚本中，并返回到调用这个脚本的实例中。

source: Just make one enemy object, and then place multiple instances within your room to get a whole level created from only a few base objects.
zh_cn: 只需制作一个敌军物体，然后放置多个实例在你的房间里。利用这些你就可以很方便地只用几个物体就做好整个游戏。

source: Key Bindings
zh_cn: 热键设定

source: Let us explain this with an example:
zh_cn: 让我们举个例子来说明如何使用时间轴：

source: Let's find out a bit more about them then...
zh_cn: 接下来让我们更多关于数组的东西……

source: Let's start by looking at the path editor and how that works.
zh_cn: 让我们从认识路径编辑器开始了解路径。

source: Loading Sprites
zh_cn: 加载精灵

source: Local Notifications
zh_cn: 本地通知

source: Locals
zh_cn: Locals（局部）

source: MP3 (*.mp3) files should be used for background music as GameMaker: Studio only permits you to play one music track at a time.
zh_cn: MP3 (*.mp3) 文件用于背景音乐，GameMaker: Studio 只允许同时播放 一个 音乐

source: Mac OS X
zh_cn: Mac OS X 模块

source: Marketplace
zh_cn: 市场

source: Masks
zh_cn: 遮罩
